# IsDataOutOfDate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..IsDataOutOfDate Method
ViewSchedule Class See Also
---
Indicates whether the schedule data is out of date.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsDataOutOfDate()
```

Visual Basic
---
```text
Public Function IsDataOutOfDate As Boolean
```

Visual C++
---
```text
public:
bool IsDataOutOfDate()
```

# ### Return Value
True if the schedule data is out of date, false otherwise.
# Remarks
To improve performance, the ViewSchedule may contain TableSections that are only updated on demand. For example, the body section of a schedule is not updated when the ViewSchedule is closed. In this case, you need to call RefreshData to avoid getting the stale data.
# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace